JanBomba/STM3210E-Temperature-Controller/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define key_w1_Pin GPIO_PIN_2
#define key_w1_GPIO_Port GPIOE
#define key_k1_Pin GPIO_PIN_3
#define key_k1_GPIO_Port GPIOE
#define key_w2_Pin GPIO_PIN_4
#define key_w2_GPIO_Port GPIOE
#define key_k2_Pin GPIO_PIN_5
#define key_k2_GPIO_Port GPIOE
#define key_w3_Pin GPIO_PIN_6
#define key_w3_GPIO_Port GPIOE
#define key_k3_Pin GPIO_PIN_1
#define key_k3_GPIO_Port GPIOF
#define key_w4_Pin GPIO_PIN_2
#define key_w4_GPIO_Port GPIOF
#define key_k4_Pin GPIO_PIN_3
#define key_k4_GPIO_Port GPIOF
#define LED_Relay_Pin GPIO_PIN_6
#define LED_Relay_GPIO_Port GPIOF
#define LM35_Pin GPIO_PIN_3
#define LM35_GPIO_Port GPIOC
#define JOY_SEL_Pin GPIO_PIN_7
#define JOY_SEL_GPIO_Port GPIOG
#define JOY_DOWN_Pin GPIO_PIN_3
#define JOY_DOWN_GPIO_Port GPIOD
#define JOY_UP_Pin GPIO_PIN_15
#define JOY_UP_GPIO_Port GPIOG
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
